doc/interval-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-23 Thu 14:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Interval Notes</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Interval Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3560efa">Setting the Baseline Default Reader</a></li>
<li><a href="#org898d323">Universal Time and Timestamp Libraries</a></li>
<li><a href="#org80415b8">Intervals - Introduction and Use Cases</a>
<ul>
<li><a href="#org012c0f4">Sample Interval</a></li>
<li><a href="#org90f22cc">Allowable Formats of the parameter to Interval</a>
<ul>
<li><a href="#orgd205838">SQL Standard Format</a></li>
<li><a href="#org2988b17">Traditional Postgresql Format</a></li>
<li><a href="#orgc7ca9c8">ISO 8601 Format with Designators</a></li>
<li><a href="#orga6f85aa">ISO 8601 Alternative Format</a></li>
</ul>
</li>
<li><a href="#orgb303133">Formatting Intervals to String</a></li>
<li><a href="#orga393752">Math with Intervals</a></li>
<li><a href="#org1556b81">Extracting Subparts</a></li>
<li><a href="#orgc18ee0e">Justify Days and Hours</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3560efa" class="outline-2">
<h2 id="org3560efa">Setting the Baseline Default Reader</h2>
<div class="outline-text-2" id="text-org3560efa">
<p>
Just to ensure that we have the same baseline readtable, we are going
to make sure that the cl-postgres:*sql-readtable* is set to the default.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(setf cl-postgres:*sql-readtable*
        (cl-postgres:copy-sql-readtable
         cl-postgres::*default-sql-readtable*))
</pre>
</div>
</div>
</div>
<div id="outline-container-org898d323" class="outline-2">
<h2 id="org898d323">Universal Time and Timestamp Libraries</h2>
<div class="outline-text-2" id="text-org898d323">
<p>
Absent anthing else, a query to postgresql through postmodern will return a
universal time. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:current-timestamp)) :single)

3743806998
</pre>
</div>
<p>
To get a timestamp, you could use the local-time library or the simple-date
library. Just for comparison sake, we will use both and get the universal time
from both the system and from postgresql.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(local-time:universal-to-timestamp
  (query (:select (:current-timestamp))
    :single))

@2018-08-20T19:23:34.000000-07:00

(local-time:universal-to-timestamp (get-universal-time))

@2018-08-20T19:23:42.000000-07:00

(simple-date:universal-time-to-timestamp (get-universal-time))

#&lt;SIMPLE-DATE:TIMESTAMP 21-08-2018T02:26:00&gt;

(simple-date:universal-time-to-timestamp
  (query (:select (:current-timestamp))
    :single))

#&lt;SIMPLE-DATE:TIMESTAMP 21-08-2018T02:26:18&gt;
</pre>
</div>
<p>
Notice something interesting about the simple-date timestamp compared to the
local-time timestamp? The local-time timestamp is (at least on the machine
I am using as I write this and the postgresql server it is connected to)
showing a Pacific Daylight time, 7 hours earlier than GMT. The simple-date
timestamp is showing the GMT time. If you care about
timezones, you will need to pay attention to where your server is, where the
clients are and what do you want to be tracking or calculating to.
</p>
</div>
</div>

<div id="outline-container-org80415b8" class="outline-2">
<h2 id="org80415b8">Intervals - Introduction and Use Cases</h2>
<div class="outline-text-2" id="text-org80415b8">
<p>
For a simple tutorial on the Postgresql interval data type, there are
several online articles, see, e.g. the official documentation at
<a href="https://www.postgresql.org/docs/current/static/datatype-datetime.html">https://www.postgresql.org/docs/current/static/datatype-datetime.html</a>,
<a href="https://www.postgresql.org/docs/current/static/functions-datetime.html">https://www.postgresql.org/docs/current/static/functions-datetime.html</a>
<a href="http://www.postgresqltutorial.com/postgresql-interval/">http://www.postgresqltutorial.com/postgresql-interval/</a> or
</p>

<p>
Intervals are a way of adding, subtracting, etc a time period with a date.
</p>
</div>

<div id="outline-container-org012c0f4" class="outline-3">
<h3 id="org012c0f4">Sample Interval</h3>
<div class="outline-text-3" id="text-org012c0f4">
<p>
Just to see what an interval looks like returned from a query using s-sql. Note
that the interval parameter is a string within a form provided to the :interval sql-op.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second"))
  :single)

((:MONTHS 77) (:DAYS 4) (:SECONDS 10921) (:USECONDS 0))
</pre>
</div>
</div>
</div>

<div id="outline-container-org90f22cc" class="outline-3">
<h3 id="org90f22cc">Allowable Formats of the parameter to Interval</h3>
<div class="outline-text-3" id="text-org90f22cc">
<p>
There are four different formats available for providing the interval parameter.
Choose whichever one you like:
</p>
</div>
<div id="outline-container-orgd205838" class="outline-4">
<h4 id="orgd205838">SQL Standard Format</h4>
<div class="outline-text-4" id="text-orgd205838">
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:interval "1-2"))
  :single)

((:MONTHS 14) (:DAYS 0) (:SECONDS 0) (:USECONDS 0))
</pre>
</div>
</div>
</div>
<div id="outline-container-org2988b17" class="outline-4">
<h4 id="org2988b17">Traditional Postgresql Format</h4>
<div class="outline-text-4" id="text-org2988b17">
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:interval "3 4:05:06"))
  :single)

((:MONTHS 0) (:DAYS 3) (:SECONDS 14706) (:USECONDS 0))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc7ca9c8" class="outline-4">
<h4 id="orgc7ca9c8">ISO 8601 Format with Designators</h4>
<div class="outline-text-4" id="text-orgc7ca9c8">
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:interval "1 year 2 months 3 days 4 hours 5 minutes 6 seconds"))
  :single)

((:MONTHS 14) (:DAYS 3) (:SECONDS 14706) (:USECONDS 0))
</pre>
</div>
</div>
</div>
<div id="outline-container-orga6f85aa" class="outline-4">
<h4 id="orga6f85aa">ISO 8601 Alternative Format</h4>
<div class="outline-text-4" id="text-orga6f85aa">
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:interval "P0001-02-03T04:05:06"))
  :single)

((:MONTHS 14) (:DAYS 3) (:SECONDS 14706) (:USECONDS 0))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb303133" class="outline-3">
<h3 id="orgb303133">Formatting Intervals to String</h3>
<div class="outline-text-3" id="text-orgb303133">
<p>
You can use the :to-char sql-op with a format string to provide a single
string version of the date/time. The ISO 8601 interval format allows
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Abbreviation</td>
<td class="org-left">Description</td>
</tr>

<tr>
<td class="org-left">Y</td>
<td class="org-left">Year</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">MOnths</td>
</tr>

<tr>
<td class="org-left">W</td>
<td class="org-left">Weeks</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">Days</td>
</tr>

<tr>
<td class="org-left">H</td>
<td class="org-left">Hours</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">Minutes</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">Seconds</td>
</tr>
</tbody>
</table>

<p>
where hours can be specified to 12 or 24.
</p>
<pre class="example">
(query
  (:select
    (:to-char
      (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second") "YYYY:MM:DD:HH24:MI:SS"))
  :single)

"0006:05:04:03:02:01"

(query
  (:select
    (:to-char
      (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second") "HH24:MI:SS"))
  :single)

"03:02:01"
</pre>
<p>
Just to be different, we can add weeks and days instead of years and months. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
  (:select
    (:to-char
      (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second") "WW:DD:HH24:MI:SS"))
  :single)

"331:04:03:02:01"
</pre>
</div>
</div>
</div>

<div id="outline-container-orga393752" class="outline-3">
<h3 id="orga393752">Math with Intervals</h3>
<div class="outline-text-3" id="text-orga393752">
<p>
Adding or subtracting intervals from each other will result in an interval.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:+ (:interval "2h 50min") (:interval "10min")))
  :single)

((:MONTHS 0) (:DAYS 0) (:SECONDS 10800) (:USECONDS 0))
</pre>
</div>

<p>
The difference between two timestamps is always an interval. Note: you
cannot add, multiple or divide two timestamps.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (:select (:- (:timestamp "1999-12-30") (:timestamp "1999-12-11")))
 :single)

((:MONTHS 0) (:DAYS 19) (:SECONDS 0) (:USECONDS 0))
</pre>
</div>

<p>
The difference between two dates is an integer number of days, not an
interval.
</p>

<p>
Adding or subtracting an interval from another date will provide a universal time
which you can convert into a string using to-char E.g
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
  (:select (:- (:now) (:interval ("6 years 5 months 4 days 3 hours 2 minutes 1 second"))))
  :single)

3540933266

(query
 (:select
  (:to-char
    (:+ (:date "2016-12-31") (:interval "25 hours"))
    "YYYY-MM-DD"))
 :single)

"2017-01-01"

(query
 (:select
  (:to-char
   (:- (:now) (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second"))
   "YYYY-MM-DD hh24:mm:ss"))
 :single)

"2012-03-19 10:03:53"
</pre>
</div>
<p>
They can be cast back to the alist interval style:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
  (:select
    (:type (:- (:timestamp "2016-12-31 03:00") (:timestamp "2016-12-29 13:00"))
           interval))
  :single)

((:MONTHS 0) (:DAYS 1) (:SECONDS 50400) (:USECONDS
</pre>
</div>
<p>
Or you can use local-time or simple-date to convert the result into some
type of timestamp.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(local-time:universal-to-timestamp
  (query (:select (:- (:now) (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second")))
    :single))

@2012-03-16T17:35:32.000000-07:00

(simple-date:universal-time-to-timestamp
  (query (:select (:- (:now) (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second")))
    :single))

#&lt;SIMPLE-DATE:TIMESTAMP 17-03-2012T00:36:14&gt;
</pre>
</div>

<p>
You can also do the more expected sums and groupings using intervals. In
the following example, we sum the total employment days by city of the
employees with more than 1 year of service.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (:select 'city (:as (:sum (:- (:timestamp "2018-04-10")
                               'start-date))
                     'total-days)
          :from 'employee
          :group-by 'city
          :having (:&gt; (:sum (:- (:timestamp "2018-04-10") 'start-date))
                      (:interval "1 year"))))

(("Vancouver" ((:MONTHS 0) (:DAYS 21746) (:SECONDS 0) (:USECONDS 0)))
 ("New York" ((:MONTHS 0) (:DAYS 22751) (:SECONDS 0) (:USECONDS 0)))
 ("Toronto" ((:MONTHS 0) (:DAYS 20374) (:SECONDS 0) (:USECONDS 0))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1556b81" class="outline-3">
<h3 id="org1556b81">Extracting Subparts</h3>
<div class="outline-text-3" id="text-org1556b81">
<p>
You can extract a part of an interval using :extract.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:extract "minute" (:interval "5 hours 21 minutes")))
  :single)

21.0d0

(query (:select (:extract "hour" (:interval "35 hours 21 minutes")))
  :single)

35.0d0

(query (:select (:extract "day" (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second")))
  :single)

4.0d0

(query (:select (:extract "year" (:interval "6 years 5 months 4 days 3 hours 2 minutes 1 second")))
  :single)

6.0d0

(query (:select (:extract "year" (:interval "6 years 15 months 4 days 3 hours 2 minutes 1 second")))
  :single)

7.0d0

(query (:select (:extract "month" (:interval "6 years 15 months 4 days 3 hours 2 minutes 1 second")))
  :single)

3.0d0
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc18ee0e" class="outline-3">
<h3 id="orgc18ee0e">Justify Days and Hours</h3>
<div class="outline-text-3" id="text-orgc18ee0e">
<p>
You can adjust a period of days to be 30 day months and adjust a period
of hours to be 24 hour days. For example:
</p>

<pre class="example">
(query (:select (:interval "47 days 3 hours 2 minutes 1 second"))
  :single)

((:MONTHS 0) (:DAYS 47) (:SECONDS 10921) (:USECONDS 0))

(query (:select (:justify-days (:interval "47 days 3 hours 2 minutes 1 second")))
  :single)

((:MONTHS 1) (:DAYS 17) (:SECONDS 10921) (:USECONDS 0))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-08-23 Thu 14:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
